Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: However, the receiver may be messaged after finalization by other objects also being finalized at this time, so your override should guard against future use of resources that have been reclaimed, as shown by the log_file = NULL statement in the example.
ja: しかしながら、レシーバはファイナライゼーションの後にメッセージを送られることが、それもまたこの時にファイナライズされている他のオブジェクトによって行われるかもしれません、それであなたのオーバーライドは、この例でのlog_file = NULL文によって示されるように再利用されてしまうというリソースの将来の使用に対して防衛するべきです。

source: However, the string on which it is operating should not be mutated during the course of a matching operation, whether from another thread or from within the Block used in the iteration.
ja: しかしながら、別のスレッド由来かまたは繰り返しにおいて使われる「ブロック」内部由来かどうかに関係なく、それが作用している文字列がマッチング操作の経過の間に変化しないようにする必要があります。

source: However, the system makes no guarantee about the group directory's name or location in the file system.
ja: しかしながら、システムはファイルシステムにおいてグループディレクトリの持つ名前または位置について保証することをしません。

source: However, they can be used in program code to prevent a method from being inherited.
ja: しかしながら、それらはあるメソッドが継承されるのを妨げるためにプログラムコードにおいて使われることができます。

source: However, you are responsible for creating those intermediate subdirectories (using the File Manager class) in your iCloud container directory.
ja: しかしながら、あなたは、あなたのiCloudコンテナディレクトリにおいて（File Managerクラスを使って）それら中間的な下位ディレクトリを作成することに対する責任があります。

source: However, you can use the close File() method to close the file descriptor programmatically.
ja: しかしながら、あなたはclose File()メソッドを使ってファイル記述子をプログラムに基づいて閉じることができます。

source: ICU License
ja: ICUライセンス

source: ISO 2022 Japanese encoding for email.
ja: ISO 2022日本語符号化、電子メール用。

source: Identifies an Apple event whose handling has been suspended.
ja: それの処理がサスペンド（一時停止）されているあるアップルイベントを識別します。

source: Identifying Classes
ja: クラスの識別

source: If anchored matching option is specified, matches are limited to those at the start of the search range.
ja: anchoredマッチングオプションが指定されるならば、マッチは検索範囲の始まりでのそれらに限られます。

source: If includes Unit or includes Count are false, then this setting has no effect.
ja: includes Unitまたはincludes Countがfalseならば、その時この設定は効果を持ちません。

source: If with Month is specified, dd is used.
ja: with Monthが指定されるならば、ddが使われます。

source: If with Transparent Bounds matching option is specified, matching may examine parts of the string beyond the bounds of the search range, for purposes such as word boundary detection, lookahead, etc.
ja: with Transparent Boundsマッチングオプションが指定されるならば、語境界検出、先読み検索、などのような目的のために、マッチングは検索範囲の境界を越えて、文字列の一部を調べるかもしれません。

source: If with Week Of Year is specified, YYYY is used.
ja: with Week Of Yearが指定されるならば、YYYYが使われます。

source: If with Week Of Year is specified, ee is used.
ja: with Week Of Yearが指定されるならば、eeが使われます。

source: If without Anchoring Bounds matching option is specified, ^ and $ will not automatically match the beginning and end of the search range, but will still match the beginning and end of the entire string.
ja: without Anchoring Boundsマッチングオプションが指定されるならば、^と$は自動的に検索範囲の始めと終わりにマッチしません、しかし依然として文字列全体の始めと終わりにマッチします。

source: If a String is of the form “{x
ja: a Stringが “{x, y}” 形式ならば、

source: If a String only contains a single number, it is used as the x coordinate.
ja: a Stringがただ１つだけの数を含むならば、それが x 座標として使われます。

source: If an Object is nil, an NSInvalid Argument Exception is raised.
ja: an Objectがnilならば、NSInvalid Argument Exceptionが引き起こされます。

source: If are Equivalent(a, b) and are Equivalent(b, c) are both true, then are Equivalent(a, c) is also true.
ja: are Equivalent(a, b)とare Equivalent(b, c)が両方ともtrueならば、そのときare Equivalent(a, c)もまたtrueである。

source: If are In Increasing Order(a, b) and are In Increasing Order(b, c) are both true, then are In Increasing Order(a, c) is also true.
ja: are In Increasing Order(a, b)とare In Increasing Order(b, c)が両方ともtrueならば、そのときare In Increasing Order(a, c)もまたtrueである。

source: If direction is .backward, then finds the previous weekend range strictly before the given date.
ja: directionが.backwardならば、そのとき与えられた日付の厳密に前の以前の週末範囲を見つけます。

source: If direction is set to .backward, this method finds the previous match before the given date.
ja: directionが.backwardに設定されるならば、このメソッドは与えられた日付より前の以前の合致するものを見つけます。

source: If end is equal to start, the result is zero.
ja: endがstartに等しいならば、結果はゼロです。

source: If extension is an empty string or nil, all bundle resources in the specified resource directory are returned.
ja: extension空の文字列またはnilであるならば、指定されたリソースディレクトリの中の全てのバントルリソースが返されます。

source: If extension is an empty string or nil, the extension is assumed not to exist and the file URL is the first file encountered that exactly matches name.
ja: extensionが空の文字列またはnilならば、拡張子は存在しないとみなされます、そしてファイルURLは最初に出くわしたぴったりnameに一致するファイルです。

source: If extension is an empty string or nil, the returned pathname is the first one encountered where the file name exactly matches name.
ja: extensionが空の文字列またはnilならば、返されるパス名は最初に出くわしたものです、そこにおいてファイル名はぴったりnameに一致します。

source: If false, an empty subsequence is returned in the result for each consecutive pair of separator elements in the collection and for each instance of separator at the start or end of the collection.
ja: falseならば、このコレクション中の連続するseparator要素の対それぞれに、そしてコレクションの始めと終わりのseparatorインスタンスそれぞれに、１つの空の下位シーケンスが結果において返されます。

source: If false, an empty subsequence is returned in the result for each pair of consecutive elements satisfying the is Separator predicate and for each element at the start or end of the collection satisfying the is Separator predicate.
ja: falseならば、is Separator述部を満たす連続する要素のペアそれぞれに対しておよびis Separator述部を満たすコレクションの始まりまたは終わりでの要素それぞれに対して結果において１つの空の下位シーケンスが返されます。

source: If false, the attributes of the symbolic link are returned.
ja: falseならば、シンボリックリンクの属性が返されます。

source: If flag is false, the file descriptor you pass in to this method is not owned by the file handle object.
ja: flagがfalseならば、あなたがこのメソッドに渡すファイル記述子はファイルハンドルオブジェクトによって所有されません。

source: If header Fields does not specify a domain for a given cookie, the cookie is created with a default domain value of the URL.
ja: header Fieldsがドメインをある与えられたクッキーに対して指定しないならば、クッキーは省略時のドメイン値のthe URLを使って作成されます。

source: If header Fields does not specify a path for a given cookie, the cookie is created with a default path value of "/".
ja: header Fieldsがパスをある与えられたクッキーに指定しないならば、クッキーは省略時のパス値の"/"を使って作成されます。

source: If index is beyond the end of the array (that is, if index is greater than or equal to the value returned by count), an NSRange Exception is raised.
ja: indexが配列の終わりを越えるならば（すなわち、indexがcountによって返される値と同等かそれより大きいならば）、NSRange Exceptionが引き起こされます。

source: If index is beyond the end of the array (that is, if index is greater than or equal to the value returned by count), an range Exception is raised.
ja: indexが配列の終わりを越えるならば（すなわち、indexがcountによって返される値と同等かそれより大きいならば）、range Exceptionが引き起こされます。

source: If key matches a key already in table, the preexisting value; otherwise, key and value are added to table and returns NULL.
ja: keyが既にtableの中にあるキーに合致するならば、以前から存在している値です；そうでなければkeyとvalueがtableに加えられてNULLを返します。

source: If key matches a key already in table, this function releases the preexisting key and its corresponding value.
ja: keyが既にtableの中にあるキーに合致するならば、この関数は前から存在するキーとそれの対応している値を解除します。

source: If max Splits + 1 subsequences are returned, the last one is a suffix of the original collection containing the remaining elements.
ja: max Splits + 1の下位シーケンスが返されるならば、最後のものは、残りの要素を含んでいる元コレクションの後ろ部分です。

source: If n > 0, limit should be greater than i to have any effect.
ja: n > 0ならば、limitが何らかの効果を持つにはiより大きくなければなりません。

source: If n > 0, a limit that is less than i has no effect.
ja: n > 0ならば、iより少ない限度は効果を持ちません。

source: If new Member is not contained in the set but subsumes current members of the set, the subsumed members are returned.
ja: new Memberがこの集合の中に含まれないしかしこの集合の現在の要素を包含するならば、包含されたメンバが返されます。

source: If node is a directory, this method recursively creates file wrappers for each node within that directory.
ja: nodeがディレクトリならば、このメソッドは、そのディレクトリ内部の各ノードに対して再帰的にファイルラッパーを作成します。

source: If partial String needs to be modified, upon return contains the replacement string.
ja: partial Stringが修正される必要があるならば、戻りにおいて交換用文字列を含みます。

source: If path1 and path2 are directories, the contents are the list of files and subdirectories each contains—contents of subdirectories are also compared.
ja: path1とpath2がディレクトリならば、内容はそれぞれが含むファイルおよび下位ディレクトリのリストです — 下位ディレクトリの内容もまた比較されます。

source: If path begins with a tilde (~), it must first be expanded with expanding Tilde In Path, or this method will return false.
ja: pathがチルダ（~）で始まるならば、それは最初にexpanding Tilde In Pathで展開されます、またはこのメソッドはfalseを返すでしょう。

source: If path begins with a tilde (~), it must first be expanded with expanding Tilde In Path; otherwise, this method returns false.
ja: pathがチルダ（~）で始まるならば、それは最初にexpanding Tilde In Pathで展開されます；そうでなければ、このメソッドはfalseを返します。

source: If path is a filename, the method returns an enumerator object that enumerates no files—the first call to next Object() will return nil.
ja: pathがファイル名ならば、メソッドは全くファイルを列挙しない列挙子オブジェクトを返します — next Object()に対する最初の呼び出しはnilを返すでしょう。

source: If path is not a symbolic link, this parameter has no effect.
ja: pathがシンボリックリンクでないならば、このパラメータは効果を持ちません。

source: If pointer matches an item already in table, returns the preexisting pointer; otherwise, pointer is added to the table and returns NULL.
ja: pointerが既にtableの中にある項目に合致するならば、以前から存在しているポインタを返します、そうでなければ、pointerがtableに加えられてNULLを返します。

source: If pointer matches an item already in table, this function releases the preexisting item.
ja: pointerが既にtableの中にある項目に合致するならば、この関数は前から存在する項目を解除します。

source: If r exceeds the bounds of the array (if the location plus length of the range is greater than the count of the array), throws an range Exception.
ja: rが配列の境界を超えるならば（位置に範囲の長さを足したものが配列総数より大きいならば）、range Exceptionをスローします。

source: If range exceeds the bounds of the data, then the data is resized to fit.
ja: rangeがデータの境界の限界を超えるならば、そのときデータはピッタリ合うようにサイズ変更されます。

source: If range isn’t within the receiving array’s range of elements, an NSRange Exception is raised.
ja: rangeが受け手側の配列の持つ要素の範囲内でないならば、NSRange Exceptionが引き起こされます。

source: If source isn't representable as a Decimal instance, the result is nil.
ja: sourceがDecimalインスタンスとして表現可能でないならば、結果はnilです。

source: If src Path is a directory, this method creates a new directory at dst Path and then creates hard links for the items in that directory.
ja: src Pathがディレクトリならば、このメソッドは新しいディレクトリをdst Pathで作成して、それからハードリンクをそのディレクトリの中の項目に対して作成します。

source: If src URL is a directory, this method creates a new directory at dst URL and then creates hard links for the items in that directory.
ja: src Pathがディレクトリならば、このメソッドは新しいディレクトリをdst URLで作成して、それからハードリンクをそのディレクトリの中の項目に対して作成します。

source: If subpath is nil, this method searches the top-level non-localized resource directory and the top-level of any language-specific directories.
ja: subpathがnilならば、このメソッドはトップレベルのローカライズされないリソースディレクトリそして言語固有のディレクトリのトップレベルを調査します。

source: If subpath is nil, this method searches the top-level nonlocalized resource directory and the top-level of any language-specific directories.
ja: subpathがnilならば、このメソッドはトップレベルの非ローカライズのリソースディレクトリそしてあらゆる言語固有のディレクトリのトップレベルを調査します。

source: If subrange .lower Bound == data .count && subrange .count == 0 then this operation is an append.
ja: subrange .lower Bound == data .count && subrange .count == 0ならば、そのときこの演算が加えられます。

source: If suspension ID has been used in a previous invocation of set Current Apple Event And Reply Event With Suspension ID(_:) the effects of that invocation are completely undone.
ja: suspension IDが以前のset Current Apple Event And Reply Event With Suspension ID(_:)の発動において使われたならばその発動の影響は完全には完了しません。

source: If table contains a key equal to key, original Key is set to key, and value is set to the value that table maps to key.
ja: tableがkeyと等しいキーを含むならば、original Keyはkeyに設定されます、そしてvalueはその値に設定されます、それはtableがkeyにマップするものです。

source: If true the attributes of the linked-to file are returned, or if the link points to a nonexistent file the method returns nil.
ja: trueならばそれへとリンクされたファイルの属性が返されます、またはリンクが存在しないファイルを指すならばこのメソッドはnilを返します。

source: If true, the component should be incremented and wrap around to zero/one on overflow, and should not cause higher components to be incremented.
ja: trueならば、構成要素は漸増されて、オーバーフローに関して０／１ラップアラウンドをするべきです、そしてより高位の構成要素の漸増を引き起こさないべきです。

source: If true, this method creates any non-existent parent directories as part of creating the directory in path.
ja: trueならば、このメソッドは何らかの現存しない親ディレクトリをpathにおけるディレクトリ作成の一部として作成します。

source: If true, this method creates any non-existent parent directories as part of creating the directory in url.
ja: trueならば、このメソッドは何らかの存在しない親ディレクトリの作成を、urlでのディレクトリ作成の一部として行います。

source: If url is a directory, this method recursively creates file wrappers for each node within that directory.
ja: urlがディレクトリならば、このメソッドは、そのディレクトリ内部の各ノードに対して再帰的にファイルラッパーを作成します。

source: If zone is NULL, the hash table is created in the default zone.
ja: zoneがNULLならば、ハッシュテーブルは省略時のゾーンの中に作成されます。

source: If zone is NULL, the new table is created in the default zone.
ja: zoneがNULLならば、新しいテーブルは省略時のゾーンの中に作成されます。

source: If full Path doesn’t exist or the user doesn’t have access to it, returns nil.
ja: full Pathが存在しないまたはユーザがそれに対するアクセスを持たないならば、それはnilを返します。

source: If n is negative, this is the same value as the result of -n calls to index(before:).
ja: nが負ならば、これは-nがindex(before:)を呼び出すの結果と同じ値です。

source: If right Operand is 0, returns NSDivide By Zero.
ja: right Operandが０ならば、NSDivide By Zeroを返します。

source: If a String does not contain any numbers, this function returns an NSSize struct whose width and height are both 0.
ja: a Stringが何ら数字を含まないならば、この関数はNSSize構造体を返し、それの幅と高さは両方とも0です。

source: If a and b are incomparable, and b and c are incomparable, then a and c are also incomparable.
ja: aとbが比較できないならば、そしてbとcが比較できないならば、そのときaとcもまた比較できない。

source: If NULL was specified for the callback function, a and b are the key and value pointers, expressed as hexadecimal numbers.
ja: NULLがコールバック関数に対して指定されたならば、aとbはキーおよび値のポインターで、16進数として表されます。

source: If capacity is 0, a small hash table is created.
ja: capacityが０ならば、小さなハッシュテーブルが作成されます。

source: If capacity is 0, a small map table is created.
ja: capacityが０ならば、小さなマップテーブルが作成されます。

source: If date(from:) can not parse the string, returns nil.
ja: date(from:)が文字列を構文解析できないならば、nil。

source: If element is not found in the collection, returns nil.
ja: elementがコレクションの中に見つけられないならば、nilを返します。

source: If length bytes are not available, this method returns the data from the current file pointer to the end of the file.
ja: lengthバイトが利用可能でないならば、このメソッドは現在のファイルポインタからファイルの終わりまでのデータを返します。

source: If nil or an empty string it will recurse, otherwise, it does not.
ja: nilまたは空の文字列ならばそれは再帰呼び出します、そうでなければ、それはしません。、

source: If path is a symbolic link, then:
ja: pathがシンボリックリンクならば、その時：

source: If path specifies a directory, or if some other error occurs, this method returns nil.
ja: pathがディレクトリを指定するならば、または何か他のエラーが発生するならば、このメソッドはnilを返します。

source: If a Class is nil, returns nil.
ja: a Classがnilならば、nilを返します。

source: If a String does not contain any numbers, returns an NSPoint object whose x and y coordinates are both 0.
ja: a Stringが全く数を含まないならば、x と y 座標が両方とも０であるNSPointオブジェクトを返します。

source: If a String does not contain four numbers, those numbers that were scanned are used, and 0 is used for the remaining values.
ja: a Stringが４つの数字を含まないならば、走査されたそれらの数が使われます、そして０が残りの値のために使われます。

source: If NULL was specified for the callback function, the hexadecimal value of each pointer is added to the string.
ja: NULLがコールバック関数に対して指定されたならば、各ポインタの16進数値が文字列へ加えられます。

source: If a Selector Name is nil, or cannot be converted to UTF-8 (this should be only due to insufficient memory), returns (SEL)0.
ja: a Selector Nameがnil、またはUTF-8に変換できない（これはメモリ不足が原因だけであるべきです）ならば、(SEL)0を返します。

source: If false is returned and error is not nil, an NSError object describing the error is returned in that parameter.
ja: falseが返されるそしてerrorがnilでないならば、エラーを記述しているNSErrorオブジェクトがそのパラメータにおいて返されます。

source: If false is returned and error Out is not nil, an NSError object describing the error is returned in that parameter.
ja: falseが返されるそしてerror Outがnilでないならば、エラーを記述しているNSErrorオブジェクトがそのパラメータにおいて返されます。

source: If false, this method fails if any of the intermediate parent directories does not exist.
ja: falseならば、このメソッドは中間にある親ディレクトリのどれかが存在しないならば失敗します。

source: If n is positive, this is the same value as the result of n calls to index(after:).
ja: nが正ならば、これはnでindex(after:)を呼び出すの結果と同じ値です。

source: If namestr is nil, returns nil.
ja: namestrがnilならば、nilを返します。

source: If path is a directory, every item contained in path must be deletable by the current process.
ja: pathがディレクトリならば、pathに含まれるあらゆる項目は現在のプロセスによって削除されなければなりません。

source: If path is a symbolic link, this method traverses the link.
ja: pathがシンボリックリンクならば、このメソッドはそのリンクを辿ります。

source: If a String only contains a single integer, it is used as the location value.
ja: a Stringがただ１つの整数を含むならば、それは位置の値として使われます。

source: If a String only contains a single number, it is used as the width.
ja: a Stringがただ１つの数字を含むならば、それは幅として使われます。

source: If another Date is nil, the results are undefined.
ja: another Dateがnilならば、結果は未定義です。

source: If i is equal to the collection’s end Index property, the complexity is O(n), where n is the length of new Elements.
ja: iがコレクションのend Indexプロパティと等しいならば、計算量はO(n)です、ここでnはnew Elementsの長さです。

source: If string is equal to the value of the converted object, such as for formatters whose converted value type is NSString, it can be returned by reference without creating a new object.
ja: stringが変換されたオブジェクトの値と等しいならば、例えばそれの変換された値型がNSStringであるフォーマッタに対してなど、それは新しいオブジェクトの作成なしに参照によって返されることができます。

source: If a Class Name is nil, returns nil.
ja: a Class Nameがnilならば、nilを返します。

source: If a String does not contain any numbers, this function returns an NSRect object with a rectangle whose origin is (0, 0) and width and height are both 0.
ja: a Stringが何ら数字を含まないならば、この関数はある矩形をもつNSRectオブジェクトを返し、それの起点は (0, 0) そして幅と高さは両方とも０です。

source: If key matches a key already in table, value is retained and the previous value is released, using the retain and release callback functions that were specified when the table was created.
ja: keyが既にtableの中にあるキーに合致するならば、valueは保持されます、そして以前の値は解除されます、テーブルが作成された時に指定されたretainとreleaseコールバック関数を使います。

source: If path doesn’t exist, this value is undefined upon return.
ja: pathが存在しないならば、この値は戻りにおいて未定義です。

source: If pointer matches an item already in the table, the previous pointer is released using the release callback function that was specified when the table was created.
ja: pointerが既にテーブルの中の項目に合致するならば、テーブル作成時に指定されたreleaseコールバック関数を使って、前のポインタは解除されます。

source: If src Path is (or contains) a symbolic link, the symbolic link is copied to the new location and not converted to a hard link.
ja: src Pathが（または含まれるものが）シンボリックリンクならば、そのシンボリックリンクが新しい場所にコピーされ、ハードリンクに変換されません。

source: If src URL is (or contains) a symbolic link, the symbolic link is copied and not converted to a hard link at dst URL.
ja: src URLが（または含まれるものが）シンボリックリンクならば、そのシンボリックリンクがコピーされ、dst URLでハードリンクに変換されません。

source: If true, only nonempty subsequences are returned.
ja: trueならば、空でない下位シーケンスだけが返されます。

source: If possible Prefix has no elements, the return value is true.
ja: possible Prefixが１つも要素を持たないならば、戻り値はtrueです。

source: If a String does not contain any integers, this function returns an NSRange struct whose location and length values are both 0.
ja: a Stringが何ら整数を含まないならば、この関数はNSRange構造体を返し、それの位置と長さの値は両方とも０です。

source: If url doesn’t exist or the user doesn’t have access to it, returns nil.
ja: urlが存在しないまたはユーザがそれに対するアクセスを持たないならば、それはnilを返します。

source: If a block stops further enumeration, that block continues to run until it’s finished.
ja: あるブロックがその先の列挙を止めるならば、そのブロックはそれが完了するまで実行を継続します。

source: If a class adopts a protocol that incorporates another protocol, it must also implement all the methods in the incorporated protocol or inherit those methods from a class that adopts it.
ja: あるクラスが別のプロトコルを取り入れるプロトコルを採用するならば、それは、取り入れられたプロトコル中の全てのメソッドを実装するか、それを採用するクラスからそれらのメソッドを継承しなければなりません。

source: If a cloud-based file or directory has not been downloaded yet, calling this method starts the download process.
ja: クラウドベースのファイルまたはディレクトリがまだダウンロードされていないならば、このメソッドを呼ぶことはダウンロードプロセスを開始します。

source: If a date formatter uses relative date formatting, where possible it replaces the date component of its output with a phrase—such as “today” or “tomorrow”—that indicates a relative date.
ja: 日付フォーマッタが相対日付書式設定を使うならば、そこにおいてそれの出力の日付構成要素を相対日付を指し示す語句 — 例えば “today” または “tomorrow” など — と置き換えることが可能です。

source: If a descriptor with that keyword already exists in the receiver, it is replaced.
ja: そのキーワードを持つ記述子が既にレシーバにおいて存在するならば、それは置き換えられます。

source: If a file already exists at path, this method overwrites the contents of that file if the current process has the appropriate privileges to do so.
ja: ファイルが既にpathで存在するならば、このメソッドはそのファイルの内容を上書きします、もし現在のプロセスがそうするのに適切な特権を持つならば。

source: If a file with the same name already exists at dst Path, this method stops the copy attempt and returns an appropriate error.
ja: 同じ名前を持つファイルが既にdst Pathで存在するならば、このメソッドはコピーの試みを停止して、適切なエラーを返します。

source: If a file with the same name already exists at dst URL, this method stops the copy attempt and returns an appropriate error.
ja: 同じ名前を持つファイルが既にdst URLで存在するならば、このメソッドはコピーの試みを停止して、適切なエラーを返します。

source: If a formatter is set to be lenient, when parsing a string it uses heuristics to guess at the date which is intended.
ja: フォーマッタが寛大であるように設定されるならば、文字列を構文解析する場合それは発見的手法を使って意図される日付を推測します。

source: If a given capture group does not participate in a given match, then [result range At Index: idx] will return {NSNot Found, 0}.
ja: ある捕獲グループが与えられたマッチに関与しないならば、 [result range At Index: idx]は{NSNot Found, 0}を返すでしょう。

source: If a matching resource file is not found, it then looks in the top level of an available language-specific .lproj folder.
ja: 合致しているリソースファイルが見つけられないならば、それはそのとき利用可能な言語固有の.lprojフォルダのトップレベルをのぞきます。

source: If a number is more precise than that, it must be rounded off.
ja: ある数がそれより大きい精度を持つならば、それは丸められなければなりません。

source: If a previous point (x,y) was transformed to (x’,y’), inverting the matrix and applying it to point (x’,y’) yields the point (x,y).
ja: 以前の点(x,y)が(x’,y’)に変換されたならば、その行列を逆にしてそれを点(x’,y’)に適用することは、点(x,y)を生み出します。

source: If a replacement is returned, your overriding method is responsible for releasing the receiver.
ja: 代わりの物を返すならば、あなたのオーバーライドしているメソッドは、そのレシーパをリリースする責任があります。

source: If a subclass overrides this method and does not override is Partial String Valid(_: proposed Selected Range: original String: original Selected Range: error Description:), this method will be called as before (is Partial String Valid(_: proposed Selected Range: original String: original Selected Range: error Description:) just calls this one by default).
ja: サブクラスがこのメソッドをオーバーライドするそしてis Partial String Valid(_: proposed Selected Range: original String: original Selected Range: error Description:)をオーバーライドしないならば、このメソッドは前と同じく呼び出されるでしょう（is Partial String Valid(_: proposed Selected Range: original String: original Selected Range: error Description:) は、初期状態で単にこのものを呼び出すだけです）。

source: If a temporary directory is not available, put this item in a uniquely named directory that is in the same directory as the original item.
ja: 一時ディレクトリが利用可能でないならば、この項目を独特に命名されたディレクトリの中においてください、それは元の項目と同じディレクトリの中にです。

source: If a value within the JSON fails to decode, this method throws the corresponding error.
ja: JSON内部の値がデコードに失敗するならば、このメソッドは対応するエラーをスローします。

source: If an Host object has more than one name, the additional names are variations on the same name, typically the basic host name plus the fully qualified domain name.
ja: Hostオブジェクトが複数の名前を持つならば、追加の名前は同じ名前の変形版です、概して基本ホスト名に完全修飾ドメイン名を足したもの。
